app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
    def destroy
        @comment = Comment.find(params[:id])
        if  @comment.destroy
            @comments = Comment.all