app/controllers/comments_controller.rb

    def create
        @comment = Comment.new(comment_params)
        @comment.event_log_id = params[:event_log_id]
        if @comment.save
---
INSERT INTO "comments" ("content", "created_at", "updated_at", "event_log_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "number 4 is bad"], ["created_at", "2022-02-11 01:45:08.211756"], ["updated_at", "2022-02-11 01:45:08.211756"], ["event_log_id", 1]]

    def destroy
        @comment = Comment.find(params[:id])
        if  @comment.destroy
            @comments = Comment.where(event_log_id: @comment.event_log_id)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 6]]
SELECT "comments".* FROM "comments" WHERE "comments"."event_log_id" = $1  [["event_log_id", 10]]

    def index
        @comments = Comment.where(event_log_id: params[:event_log_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."event_log_id" = $1  [["event_log_id", 4]]

    def update
        @comment = Comment.find(params[:id])
        if @comment.update(comment_params)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "number 4 is bad"], ["updated_at", "2022-02-11 06:30:04.473649"], ["id", 12]]