app/controllers/event_logs_controller.rb

INSERT INTO "event_logs" ("log_id", "source_IP", "destination_IP", "source_valid", "source_private", "destination_valid", "destination_private", "created_at", "updated_at", "log") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
        @eventLog.destination_private = hash[:private]
        @eventLog.destination_valid = hash[:valid]

        if(@eventLog.save)

SELECT  "event_logs".* FROM "event_logs" WHERE "event_logs"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "event_logs" WHERE "event_logs"."id" = $1  [["id", 8]]
SELECT "event_logs".* FROM "event_logs"
---
    def destroy
        eventLog = EventLog.find(params[:id])
        if eventLog.destroy
            @eventLogs = EventLog.all

SELECT "event_logs".* FROM "event_logs"
---
    def index
        @eventLogs = EventLog.all

SELECT  "event_logs".* FROM "event_logs" WHERE "event_logs"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def show
        @eventLog = EventLog.find_by(id: params[:id])